In [1]:
import pandas as pd

In [7]:
var1=pd.DataFrame({'A':[1,2,3,4],'B':[11,12,13,14]})
var2=pd.DataFrame({'A':[1,2,3,5],'c':[21,22,23,24]})

In [9]:
var3=pd.merge(var1,var2,on='A')
var3
# now they are merged having a as common
# since 5 is not common so that data is excluded

   A   B   c
0  1  11  21
1  2  12  22
2  3  13  23

In [12]:
pd.merge(var1,var2,how='outer',indicator=True)

   A     B     c      _merge
0  1  11.0  21.0        both
1  2  12.0  22.0        both
2  3  13.0  23.0        both
3  4  14.0   NaN   left_only
4  5   NaN  24.0  right_only

In [13]:
pd.merge(var1,var2,left_index=True,right_index=True)

   A_x   B  A_y   c
0    1  11    1  21
1    2  12    2  22
2    3  13    3  23
3    4  14    5  24

In [14]:
pd.merge(var1,var2,left_index=True,right_index=True,suffixes=('x waly','y waly'))

   Ax waly   B  Ay waly   c
0        1  11        1  21
1        2  12        2  22
2        3  13        3  23
3        4  14        5  24

In [16]:
sr1=pd.Series([1,2,3,4])
sr2=pd.Series([11,12,13,14])
pd.concat([sr1,sr2])

0     1
1     2
2     3
3     4
0    11
1    12
2    13
3    14
dtype: int64

In [17]:
var1=pd.DataFrame({'A':[1,2,3,4],'B':[11,12,13,14]})
var2=pd.DataFrame({'A':[1,2,3,5],'c':[21,22,23,24]})
pd.concat([var1,var2],axis=0)

   A     B     c
0  1  11.0   NaN
1  2  12.0   NaN
2  3  13.0   NaN
3  4  14.0   NaN
0  1   NaN  21.0
1  2   NaN  22.0
2  3   NaN  23.0
3  5   NaN  24.0

### join

In [26]:
varr1=pd.DataFrame({'A':[1,2,3,4],'B':[11,12,13,14]})
varr2=pd.DataFrame({'c':[10,20],'d':[11,12]})

In [36]:
varr2.join(varr1,how='outer')

      c     d  A   B
0  10.0  11.0  1  11
1  20.0  12.0  2  12
2   NaN   NaN  3  13
3   NaN   NaN  4  14